lvx/base/Catalogs/бит_БотыTelegram.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_БотыTelegram</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НуженПинКод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПинКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбслуживатьЧаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/Enums/бит_СтатусРегистрацииТелеграм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_СтатусРегистрацииТелеграм</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Разрешено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрещено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетРегистрации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/Catalogs/бит_ЧатыTelegram.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ЧатыTelegram</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_БотыTelegram</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусРегистрации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусРегистрацииТелеграм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеКоманды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КомандаТелеграм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_КомандыБотуТелеграм</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/Catalogs/бит_БотыTelegram/Forms/ФормаСозданияЧатов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Бот = Параметры.Бот;
	
	ПолучитьЧатыТекущегоБота();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	
   ЗаписатьДанные();
   ОповеститьОбИзменении(Тип("СправочникСсылка.бит_ЧатыTelegram"));
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписатьЗакрыть(Команда)
	
   ЗаписатьДанные();
   ОповеститьОбИзменении(Тип("СправочникСсылка.бит_ЧатыTelegram"));	   
   Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьВсе(Команда)
	
	ОбработатьФлаги(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьВсе(Команда)
	
	ОбработатьФлаги(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ПолучитьЧатыТекущегоБота();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура создает чаты и назначает пользователям.
//
&НаСервере
Процедура ЗаписатьДанные()

	КоличествоЗаписанных = 0;
	
	Для каждого СтрокаТаблицы Из ТаблицаЧаты Цикл
		
		Если НЕ СтрокаТаблицы.Выполнять Тогда
			Продолжить;
		КонецЕсли; 
		
		ДанныеЧата = Справочники.бит_ЧатыTelegram.ДанныеЧатаПоИдентификатору(СтрокаТаблицы.ИД, Бот);
		Если НЕ ЗначениеЗаполнено(ДанныеЧата.Чат) Тогда
			
			НовыйЧат = Справочники.бит_ЧатыTelegram.СоздатьЭлемент();
			НовыйЧат.ИД 			   = СтрокаТаблицы.ИД;
			НовыйЧат.ОсновнойБот 	   = Бот;
			НовыйЧат.Наименование 	   = СтрокаТаблицы.Наименование;
			НовыйЧат.СтатусРегистрации = Перечисления.бит_СтатусРегистрацииТелеграм.ОжидаетРегистрации;
			
			НовыйЧат.УстановитьНовыйКод();
			Если НовыйЧат.ПроверитьЗаполнение() Тогда
				НовыйЧат.Записать();
				КоличествоЗаписанных = КоличествоЗаписанных + 1;
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	ТекстСообщения = НСтр("ru='Записано %1 чатов.';en='Recorded chats %1.'");
	ТекстСообщения = СтрШаблон(ТекстСообщения, КоличествоЗаписанных);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
	ПолучитьЧатыТекущегоБота();
	
КонецПроцедуры // ЗаписатьДанные()

&НаСервере
Процедура ПолучитьЧатыТекущегоБота()
	
	ТаблицаЧаты.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Бот.Токен) Тогда
	
		ТекстСообщения = НСтр("ru='Выберите бота.';en='Select bot.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
	КонецЕсли; 
	
	РезДанные = Справочники.бит_БотыTelegram.НайтиЧаты(Бот);
	
	Для каждого МодельСтроки Из РезДанные.Данные Цикл
	
		НоваяСтрока = ТаблицаЧаты.Добавить();
		НоваяСтрока.Выполнять = Истина;
		НоваяСтрока.ИД = МодельСтроки.ИД;
		НоваяСтрока.Наименование = МодельСтроки.Наименование;
	
	КонецЦикла;  		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьФлаги(ЗначениеФлага)
	
	Для каждого СтрокаТаблицы Из ТаблицаЧаты Цикл
		СтрокаТаблицы.Выполнять = ЗначениеФлага;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
